find-flights/FindFlights-FlightSearch-LoadTest.yml
execution:
- scenario: FindFlights-LoadTest
  concurrency: 
    local: 10
    cloud: 100
  hold-for: 15m
  ramp-up: 2m

modules:
  blazemeter:
    test: "FindFlights - Search Load Test"
    report-name: "FindFlights - Search Load Report"

scenarios:
  FindFlights-LoadTest:
    script: FindFlights-FlightSearch1-Positive.jmx
    modifications:
      disable:
      - '*FUNC_ONLY'